[{"content": ["\nChicago, Ill.., February 5, 2015 – Plastics Color Corporation, the global leader in color concentrates, functional additives, and custom polymer masterbatches for the plastics industry, is celebrating its 50th anniversary in the plastics industry. \nAs Plastics Color marks this important milestone, it is important to look back and reflect on the company’s growth. As a privately-held company, Plastics Color has benefitted from a supportive parent company, PMC Global, Inc. The backing from PMC over the past 50 years has allowed Plastics Color to respond to both market changes and economic downturns, which have had national and international implications over the past several decades. \n In 1964, Kamco Plastics was formed as a styrene compounding company that provided reprocessed color compounds for the plastics industry. Over the years, the company expanded and grew to manufacture dry color, white concentrate, and other additives. Another milestone was in 1989 when the name officially changed to Plastics Color Corp. with locations in New Jersey, Illinois, and North Carolina at that time. \nThe 2000’s marked continued growth with additional facilities in California and Nanjing, China, and key product innovation propelled Plastics Color as a leading additives supplier. The most recent product developments include a line of anti-counterfeiting taggants, MiBatch, and the expansion of liquid color offerings through the LiquiSol carrier system. The company growth and product development over the past 50 years are influenced largely by growing market demand and customer innovation.\nTechnology has certainly shaped not only the growth of Plastics Color, but the plastics industry in general over the past five decades. “In 1964, the big focus for us as a company was providing a quality product and pushing it out to the market. Today, we are much more technologically advanced and are not only able to provide a quality product, but are can provide solutions for our customers,” says Timothy Workman, vice president of business development and technology. \nAdvances in technology at Plastics Color are seen throughout the business, from the production floor across the various plants, to new product development, to the creation of real-time digital customer interfaces. Plastics Color today is focused on understanding customers’ business, their audiences, markets, cultures, and geography to provide a solutions approach to color needs. \nJoe Byrne, President of Plastics Color says, “This is an exciting time for Plastics Color. We are looking forward to 2015 and how our business will continue to evolve to better serve our customers. We truly care about the relationships we have with our customers, and our ability to provide quality products and solutions in response to real challenges.” \nA key to Plastics Color’s 50-year success is its ability to adapt to an ever-changing consumer-driven market. To support the continued growth of its business, Plastics Color recently established a new leadership team and committed itself to a new quality statement. The company will continue to focus on growth as it enters new markets, developing innovative color solutions for its customers. Learn more at www.PlasticsColor.com.\nAbout Plastics Color Corporation\nPlastics Color Corporation, headquartered in Chicago, I.L., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. Plastics Color supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help develop new cutting-edge products that lead the market. Plastics Color has 50 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. Plastics Color’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. Plastics Color also provides testing and product development services through the Solutions Center in Asheboro, N.C. For more information, email info@plasticscolor.com or visit www.plasticscolor.com. \n \n"], "news_url": "http://plasticscolor.com/about/news/press-releases/136-plastics-color-corporation-celebrates-50-years-in-the-plastics-industry.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corporation Celebrates 50 Years in the Plastics Industry\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nChicago, IL, January 13, 2015 – Plastics Color Corp., a global leader in color concentrates, functional additives, and custom polymer masterbatches for the plastics industry, has announced the appointment of Jennifer Presnell as Corporate Quality Systems and Regulatory Affairs Manager. This new position allows Plastics Color the opportunity to have dedicated corporate oversight on quality systems. \n Presnell started with Plastics Color in 1997 as a Quality Control Technician and advanced within the organization to managerial roles including Quality Control Supervisor and Corporate Lab Manager. She has managed the regulatory department, color development lab, and ISO throughout her career at  Plastics Color. \n“This is exciting because  I will continue to maintain our regulatory compliance status but also manage the quality process of our company,” said Presnell. “Instead of being involved in the day-to-day quality control of Plastics Color, I have the opportunity to work closely with department managers to create systems and audit processes from a corporate level.”\nTimothy Workman,Vice President of Business Development for Plastics Color said the new position  is unique in the plastics  industry. “We are dedicated to providing our customers with both excellent product and service; and, investment in this type of dedicated oversight symbolizes that,” said Workman. “Jennifer’s professional background lends her to being a great fit.”\nPresnell will be based at Plastics Color’s Solutions Center in Asheboro, N.C.; however, she oversees all Plastics Color facilities and will spend substantial time traveling to streamline all facilities. \nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC), located in Chicago, IL is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. Plastics Color supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help develop new cutting-edge products that lead the market. Plastics Color has 50 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. Plastics Color’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. Plastics Color also provides testing and product development services through the Solutions Center in Asheboro, N.C. For more information, email info@plasticscolor.com or visit www.plasticscolor.com. \n"], "news_url": "http://plasticscolor.com/about/news/press-releases/134-plastics-color-fills-new-position-of-corporate-quality-systems-and-regulatory-affairs-manager.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Fills New Position of Corporate Quality Systems and Regulatory Affairs Manager\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nMiBatch™ Anti-Counterfeiting Resin Technology Provides Unique Fingerprint for Plastics Packaging\nCHICAGO, November 2, 2014 - Plastics Color Corp., a global leader in color concentrates, functional additives, and custom polymer masterbatches for the plastics industry, meets the needs of the packaging industry through a multilayered approach to brand protection with its MiBatch™ anti-counterfeting resins. This new anti-counterfeiting technology for thermoplastics delivers major advantages for the packaging industry when it comes to risk mitigation, supply chain security, and corporate governance. Plastics Color highlighted the use of MiBatch at Pack Expo International (Booth #5183) Nov. 2-5 at McCormick Place in Chicago.\nBrand owners and suppliers of plastics packaging continue to face counterfeiting issues on a regular basis. Counterfeiting is a multi-billion-dollar threat to consumers and businesses worldwide and compromises brand value and poses serious safety risks, according to Plastics Color. “MiBatch was developed as an extremely cost-effective anti-counterfeiting measure enabling manufacturers and retailers to protect brand identity and ensure supply chain integrity,” explained Tim Workman, vice president of business development for Plastics Color.\nMiBatch™ technology uses covert chemical or visual markers called taggants that promote anti-counterfeiting by providing a unique fingerprint to the packaging or product. Because the taggant provides a unique “marker,” they can protect the OEM or brand owner from costly recalls, repairs, and even litigation by providing proof of the product’s authenticity. Tagging the product and the plastic packaging offers double security.\n“Since MiBatch is an anti-counterfeiting taggant that is placed in the material itself – whether in the plastic packaging or the plastic product – authentication can be done at every level of the supply chain,” said Workman.\nThese markers are created through spray pyrolysis during the manufacturing process. This patented process produces spherical particles over a wide range of compositions so that there is homogeneous composition control. This is considered a proactive approach to security and risk management. The unique taggants in MiBatch are compatible with a wide variety of resins to impart an extremely high level of security and verification. \nMiBatch taggants are easy to authenticate but very difficult for criminals to detect and replicate, according to Plastics Color. They function consistently under wide-ranging environmental conditions without affecting product performance, and each customer’s unique taggant “signature” can be consistently produced at any volume.\nTaggants are added to plastic masterbatches during the compounding process. Plastics Color custom formulates these markers for each client. XRF (X-ray fluorescence) and laser detection equipment (handheld or inline) is employed to “read” the embedded taggant signature and verify authenticity of the polymer, product, or component. The detection systems are tuned to look for specific elements and combinations for the unique taggant.\nIf an OEM is having issues with supply chain security, MiBatch is an effective solution that provides authentication tools for each step of the process. OEMs are able to work with their specific security gaps and take a proactive approach to hindering counterfeiting issues from within; whether from production facilities, packaging facilities, or via the shipping process.\nLearn more about MiBatch by visiting www.PlasticsColor.com.\nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC), located in Asheboro, N.C., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. Plastics Color supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help develop new cutting-edge products that lead the market. Plastics Color has 50 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. Plastics Color’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. Plastics Color also provides testing and product development services through the Solutions Center in Asheboro, N.C. For more information, email info@plasticscolor.com or visit www.plasticscolor.com. \n"], "news_url": "http://plasticscolor.com/about/news/press-releases/132-plastics-color-corp-delivers-multilayered-approach-to-brand-protection.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corp. Delivers Multilayered Approach to Brand Protection\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nASHEBORO, N.C., October 20, 2014 – Plastics Color Corporation (PCC), the global leader in color concentrates, functional additives and custom polymer masterbatches for the plastics industry, once again is joining the Color Marketing Group (CMG) at its 2014 International Summit, November 14-16 in Orlando, Fla. \n \nAs a leading total solutions provider, PCC understands the value of color trends and partnerships among design professionals. “One of the key value-added services we provide to our customers is our knowledge of color trends and palettes,” said Timothy Workman, vice president of business development for Plastics Color.  “Whether it’s through traditional sources such as color chip palettes or our innovative mobile application and web portal, isaac™, we listen to our customers’ concerns and provide them with solutions that embrace the concept of total color management.” \nThe 2014 CMG International Summit is a symposium where worldwide experts share ideas and information relating to color trends, color palettes, and other influencing forces. \nThrough work at its Customer Solutions Center, based at the Asheboro, N.C. research and production facility, Plastics Color provides color solutions for customers and strategic partners in a collaborative environment where color forecasts are paramount to the success of end applications.\nLearn more Plastics Color services, color trending, and the Solutions Center at www.plasticscolor.com. \nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC), located in Asheboro, N.C., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help develop new cutting-edge products that lead the market. PCC has 50 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through the Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com. \n"], "news_url": "http://plasticscolor.com/about/news/press-releases/131-plastics-color-corporation-to-join-the-color-marketing-group-s-international-summit.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corporation to Join the Color Marketing Group’s International Summit\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nASHEBORO, N.C., September 11, 2014 – Plastics Color Corporation (PCC), the global leader in color concentrates, functional additives and custom polymer masterbatches for the plastics industry, will exhibit at PACK EXPO International November 2-5 in Chicago, Ill. At its Booth (N-5183) in the North Upper Hall at McCormick Place, PCC will showcase several innovative and market-leading products for the plastics packaging industry.\n \nAs a leading total solutions provider, PCC custom formulates a variety of additives that provide direct solutions for end-use applications in the packaging industry. MiBatch™ is a leading technology that promotes anti-counterfeiting through covert taggants imbedded during the manufacturing process. MicroBlok® is an antimicrobial and antifungal line of proprietary additives that impede growth of microbes on treated surfaces. Meanwhile, FlamaSol™ is another key functional additive that improves the flame retardant features of end-use applications.\nVisit PCC at Booth N-5183 to also learn more about recent advances with LiquiSol™, the company’s liquid carrier system.\nLearn more about global solutions for the plastics industry by visiting www.PlasticsColor.com.\nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC), located in Asheboro, N.C., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help develop new cutting-edge products that lead the market. PCC has 50 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through the Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/130-plastics-color-corporation-to-exhibit-at-pack-expo-international-in-november.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corporation to Exhibit at PACK EXPO International in November\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nAsheboro, N.C., August 28, 2014 – Plastics Color Corporation (PCC), the global leader in color concentrates, functional additives, and custom polymer masterbatches for the plastics industry, today announced its participation in the Global Secure Summit (GSS) to be held September 24-26 in Amsterdam.\nAs a leading total solutions provider for polymer manufacturers, PCC will participate in sessions at GSS to communicate the value of anti-counterfeiting measures within the plastics industry.\nGSS offers a valuable setting for businesses to discuss technologies, strategies, and solutions to safeguard against counterfeiting and brand violation. GSS specializes in brand protection and security in a discussion-based platform.\nOne of PCC’s innovative technologies in this arena is MiBatch™. This market-leading technology uses chemical or visual markers that promote anti-counterfeiting. During the manufacturing process, this unique “fingerprint” is added to the product and later read by a laboratory or handheld device that authenticates the marker. PCC’s MiBatch is ideal for risk mitigation and supply chain security throughout the manufacturing process.\nMiBatch meets key security requirements for a range of industries including medical, luxury brands, packaging, automotive, and consumer goods. When product integrity is priority, MiBatch is paramount. Examples of MiBatch at work include instances when an OEM must secure the manufacturing process, verify that proper chemistries are utilized, or protect itself from a lawsuit.\nLearn more about MiBatch by visiting www.PlasticsColor.com.\nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC), located in Asheboro, N.C., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help develop new cutting-edge products that lead the market. PCC has 50 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through the Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/129-plastics-color-corporation-to-participate-in-global-secure-summit-in-amsterdam.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corporation to Participate  in Global Secure Summit in Amsterdam\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nAsheboro N.C., August 8, 2014 – Plastics Color Corporation (PCC), a leading supplier of color concentrates, compounds, custom-functional masterbatches and other polymer technologies for the plastics industry, today announced continued investment in its liquid color business with the appointment of a LiquiSol© Product Manager.\nPCC President Joe Bryne is pleased to announce the appointment of Mark Hass as the new LiquiSol product manager. “PCC is dedicated to offering solutions and innovative business approaches for our customers, “ said Bryne “This new role will provide additional support to our customers looking to find solutions with liquid color; it is one of many investments PCC continues to make with liquid color.” \nHass has over 20 years of experience working in both technical and business development roles with a focus on key accounts. He earned a Bachelor of Science Degree in Management from David N. Meyers College. Hass will report directly to Dave Minor, North American director of sales, with a dotted line to Timothy Workman, vice president of business development. He will manage the sales and development of the LiquiSol product line. \nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC),  headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through our Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/128-plastics-color-corporation-announces-key-appointment-in-liquid-color-business.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corporation Announces Key Appointment in Liquid Color Business\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nCalumet City, Ill., May 28, 2014  – PCC (Plastics Color Corporation), a leading supplier of color concentrates, compounds, custom-functional masterbatches and other polymer technologies for the plastics industry, today announced the addition of several key employees to its growing team of professionals.\n \nPCC President Joe Byrne is pleased to announce the appointment of Chan Howell as corporate customer service manager, Ryan McCracken as operations manager, Camille Dozier as an inside sales representative, Brandon Brown as color formulations specialist and Tracie Luck as human resources manager for the Asheboro, North Carolina facility. “The addition of these experienced team members will keep PCC moving forward in our continuing efforts to better serve our customers,” said Byrne. The total staff of the company has grown by ten percent over this time last year.\n\n\nRyan McCracken\n\n\nChan Howell\n\n\nMcCracken joined Plastics Color with over 10 years of engineering experience and a BA and MS in engineering from Michigan State University. He works out of PCC’s Calumet City plant and reports to Corporate Operations Director Wes Woldt.\nHowell, who graduated from East Carolina University, has held several sales and marketing positions since 2004. He will report to North American Sales Director Dave Minor and supervise customer service activities at all of PCC’s facilities.\nDozier, who arrived in April, is a veteran of the plastics industry, having served in a sales capacity with a distribution company for over 17 years prior to joining PCC. The Michigan State graduate will report to Commodities Manager Judy Springer at the Illinois plant.\nLuck, the Asheboro, North Carolina facility’s first human resources manager, comes to the company with over eight years in HR. She is a 2005 graduate of the University of North Carolina (Greensboro).\nBrown joined PCC’s Asheboro team this month and reports to Corporate Color Labs Manager Kay Smith.\nAbout Plastics Color Corporation\nPlastics Color Corporation (PCC), headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are accredited by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through our Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\n\n# # #\n\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/125-plastics-color-corporation-continues-to-grow-staff.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corporation Continues to Grow Staff\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\n\n\n\"The chief function of color should be to serve expression,\" explained master impressionist painter Henri Matisse.\r\n\r\nIt's a short sentiment that speaks volumes to the importance of color not simply in two dimensional art but in the natural scenery and man-made products of everyday life. Color influences, evokes, informs, persuades, soothes, motivates. Color can be linked to every emotion.\r\n\nRead full story\n"], "news_url": "http://plasticscolor.com/about/news/newsletters/123-color-me-a-winner-pcc-unveils-top-color-picks-for-2014.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tColor me… a winner PCC unveils top color picks for 2014\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\n\"Plastics Color Corporation expands production and enhances R&D to give customers more color options.  PCC continues to expand production and enhance our customer service capabilities with demand for liquid color on the rise. A new liquid color line is set to debut at our Asheboro, N.C. plant this summer, bringing full-scale liquid production to the east coast along with our expanded R&D capabilities.  Read full story\n"], "news_url": "http://plasticscolor.com/about/news/newsletters/126-liquid-color-more-than-just-a-drop-in-the-bucket.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tLiquid color: More than just a drop in the bucket\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\n\r\nPCC to demo isaac® program\r\n\nCalumet City, Ill., February 12, 2014 – PCC (Plastics Color Corporation), a leading supplier of color concentrates, compounds, custom-functional masterbatches and other polymer technologies, will demonstrate its unique product design application during a live webinar March 19, 2014. The design app, named isaac®, allows a user to drastically reduce time to market by streamlining the color design and development process. \nKey objectives of the webinar include:\n\nTo discuss a new color introduction process that can improve your speed to market.\nLearn to develop a commercialization strategy for your design team built around speed to market. \nLearn to control design choices while maintaining maximum brand impact of your new designs.\nLearn how the isaac system can impact costs of design and product introduction.\n\n \n\r\nisaac runs on any operating system including: iOS (iPhone®, iPad®) and Android® systems for tablets as well as PC and Mac. isaac allows users to select from a palette of pre-approved colors, apply them to 3-D objects and send samples electronically, design a product in real-time and share color story-boards with others in their organization. The latest version of isaac also allows PCC customers to access order history data stored on PCC’s secure servers.\nThe webinar, titled Packaging Design at the Speed of NOW, will be hosted by PCC’s Vice President of Business Development Timothy Workman and Sara Martin, color marketing and strategic accounts manager. It is scheduled for 11:00 AM EST on March 19. \nRegistration is now open at http://www.business-review-webinars.com. There is no charge to participate.\nAbout Plastics Color Corp.\n\r\nPlastics Color Corporation (PCC),  headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years of experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are certified by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through its Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\r\n\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/120-interactive-design-application-shortens-time-to-market.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tInteractive Design Application Shortens Time to Market\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\n\r\nInaugural Report Identifies Copperico and Oceanana as Leading\r\n\r\nColor Options for Consumer and Industrial Plastic Designs\r\n\nANAHEIM, Calif., February 11, 2014 – Oceanana (indigo like) and Copperico (copper like) have emerged as the leading color choices for the design of plastic products for the consumer and industrial markets, according to Plastics Color Corp.’s First Annual Color Report released today at the 2014 Medical Design and Manufacturing (MD&M) West exhibition Feb. 11-13 in Anaheim, Calif. PCC, a leading supplier of color concentrates and additive masterbatches for the plastics industry, has issued the annual color report to give customers a competitive edge in identifying current color trends and ultimately facilitate the product development cycle.\r\n\n\r\n \r\n“Our goal with the Color Report is to help designers in the initial concept stage so they can develop the right product in the right color and get it to the shelf faster,” said Tim Workman, PCC vice president of business development. “This is a value-driven effort that helps our customers shorten the product development process.”\r\n\n\r\nAs a leading plastics color specialist, PCC’s primary business focus is the manufacturing of colors that fit into its customers’ market spaces. “We have extensive information that can aid our customers in getting the right colors into their unique market space quickly,” added Workman. The color information will give customers an advantage over the competition by identifying the best color options that will impact the market and spur increased demand for new products in the industrial and consumer space, said Workman. Color selection is an important and often times lengthy process for manufacturers and PCC seeks to simplify the process and arm customers with the most up-to-date market information.\r\n\n\r\nColors were chosen from market research and data presented at PCC’s Color Marketing Group Summit in 2013. The market research data includes trending analysis, company sales information, and industry data from a broad range of markets in which PCC serves. The ongoing color evaluation - now formalized in an annual report – identified a palette of 12 high-profile colors which was pared down to two.\r\n\n\r\nOceanana can be found from the deepest of oceans to the dark blue skies at dusk and dawn and its deep color is both calming and grounding, according to the report. It is plant-derived and offers a connection with the natural world.  “Oceanana (indigo like) is making a resurgence in housewares, clothing, and textiles - becoming not only a bold neutral color but also a focus color,” according to Sara Martin, PCC’s strategic sales representative.\r\n\n\r\nMeanwhile, Copperico stands for the old and the new and the two worlds that connect together, says the report. It offers a sense of home with its warm color and use in many everyday items. “Copperico (copper like) is surpassing the popularity of the grays of silver and the yellows of gold; the warm tones of this precious metal are slowly penetrating our daily lives,” explained Martin.\r\n\n#        #       #\nAbout Plastics Color Corp.\n\r\nPlastics Color Corporation (PCC),  headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years of experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are certified by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through its Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\r\n\n\r\nPress Contact:\r\nJoseph Grande\r\n413.684.2463\r\njoe@jgrandecommunications.com\r\n\n\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/119-plastics-color-corp-continues-growth-adding-to-illinois-facility-in-2014-2.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tNew Plastics Color Corp. (PCC) Report Showcases                     Latest Color Trends for Plastic Products\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nCalumet City, Ill., December 26, 2013 – – PCC (Plastics Color Corporation), PCC (Plastics Color Corporation), a leading supplier of color concentrates, compounds, custom-functional masterbatches and other polymer technologies, has announced plans to significantly expand production capacity at its Calumet City, Illinois manufacturing facility. The expansion will add 40,000 square feet to the building and a minimum of one multi-function production line. According to PCC’s Corporate Operations Manager Wes Woldt, the new line will give PCC 40 percent more capacity in Illinois and employ seven to ten personnel including an Operations Manager, a senior leadership position which the company plans to hire in the coming weeks. “We will break ground on the project as soon as weather permits,” said Woldt, “and expect to be operational by late 2014.” According to Woldt, this is the first building expansion of the Calumet City plant since 1981.\r\n\n\r\n \r\nThe Illinois management is preparing an RFQ for new extrusion equipment and plans to select suppliers in late February. PCC President Doug Borgsdorf said, “We are looking for suppliers that will provide the same level of service and technology we provide to our customer base.”\r\n\n\r\n“We’ve been running three shifts at Cal City since March,” said Borgsdorf. “Due to a rapid expansion in our black production business, we’ve recently gone to a seven-day a week schedule to meet customer demand, increasing our capacity by 18 percent this December.” Much of PCC’s black business is coming from packaging, pipe and fiber sales, says Borgsdorf. “This expansion is part of a corporate strategy to grow our black capacity in Illinois while our facilities in North Carolina, California and China focus on liquid color, color concentrate and specialty solutions such as our new antimicrobials, flame retardants and anti-counterfeiting products.”\r\n\n\r\nPCC recently added two new extruders at its Asheboro facility and is stepping up production in China and California as well. Additionally, new liquid color production equipment has been ordered for the Asheboro facility, providing a wider range of product offerings for that plant. “Our business is growing in every area as we continually find ways to solve our customers’ challenges,” said Borgsdorf. “We are also exploring several opportunities in Latin America, with a partnership or acquisition in Brazil at the top of our list.”\r\n\nAbout Plastics Color Corporation\n\r\nPlastics Color Corporation (PCC),  headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are certified by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through our Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\r\n\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/118-plastics-color-corp-continues-growth-adding-to-illinois-facility-in-2014.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corp. Continues Growth Adding to Illinois Facility in 2014\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nNew extruders provide more flexibility\nCalumet City, Ill., November 18, 2013 – PCC (Plastics Color Corporation), a leading supplier of color concentrates, compounds, custom-functional masterbatches and other polymer technologies, has added two new production lines to its Asheboro, North Carolina manufacturing facility. According to Plant Manager Robert Wagner, the two Steer 40mm twin-screw extruders, along with ancillary equipment, allow PCC to produce lots from 50 to 2,000 pounds. “The new lines give us more flexibility, faster changeover times, tighter tolerances and reduced lead times,” said Wagner. \n\r\n \r\n“We are constantly investing in our resources, including facilities and personnel, to service our customers more efficiently,” said Wagner. “As we produce more specialized products for plastics processors, such as MicroBlok® antimicrobials, Mi Batch™ anti-counterfeiting taggants and FlamaSol™ flame retardants, we need to become more agile in producing various size batches. Our new lines give us this needed flexibility and allow us to remain cost effective,” added Wagner.\r\n\n\r\nPCC’s Asheboro facility mainly produces color, additive masterbatches and custom formulations with some white production as well. There are eight production lines, three sample lines and an A2LA certified color laboratory housed on the campus. The plant employs 44 personnel. Additionally, Asheboro is home to PCC’s Customer Solutions Center, a combination design, research and testing facility.\r\n\n\r\nIn addition to the Asheboro plant, PCC manufactures polymer products in Calumet City, Ill.; Sun Valley, Calif.; and Nanjing, China.\r\n\nAbout Plastics Color Corporation\n\r\nPlastics Color Corporation (PCC),  headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are certified by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through our Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com.\r\n\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/117-plastics-color-corp-adds-new-production-lines.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corp. Adds New Production Lines\t\t\t\t\t\t\t\t\t\n"]}, {"content": ["\nCalumet City, Ill., October 15, 2013 – Plastics Color Corporation, a leader in thermoplastic compounds and solutions, is now offering thermoset plastic molding compounds through its new venture with German manufacturer Raschig GmbH, headquartered in Ludwigshafen. Plastics Color and Raschig are both subsidiaries of Sun Valley, California-based PMC Global Inc. Raschig will be distributing PCC’s complete line of additives, masterbatches and other polymer technologies throughout Europe.\n\r\n \r\n“The expanded relationship between PCC and Raschig will help both our companies better serve our customers by offering a more complete line of polymer products for a wider variety of manufacturing needs and markets,” says PCC Vice President of Business Development Timothy Workman. “Raschig’s expertise and market experience really complements ours, and vice versa.”\nPCC will be exhibiting with Raschig at the 2013 K Show, October 16-23, in Hall 5, Stand No. F40.\n\r\nRaschig’s granulated, free-flowing molding compounds are plastics that chemically cross-link when processed. The final 3-dimensional structure obtained after the hardening process inhibits the material from subsequent deformation. The properties of these thermosets remain constant at high application temperatures, even when these temperatures are exceeded for short periods.\n\r\nRaschig produces several lines of thermosets including melamine, epoxy, polyester and phthalates. The company, founded in 1891, has plants in Ludwigshafen and Espenhain, Germany and Hoek van Holland, Netherlands. Plastics Color has manufacturing facilities in Calumet City, Ill.; Asheboro, N.C. ;Sun Valley, Calif. and Nanjing, China. \nThe following Raschig plastics products are available from PCC in North America:\n\nMelamine & Melamine/Phenolic molding compounds \nEpoxy molding compounds\nPolyester molding compounds\nSilicone molding compounds\nMelamine/Polyester molding compounds\nPhenolic molding compounds\nDiallyl phthalate & Diallyl iso-phthalate molding compounds\nPowder In-Mold Coatings\n\r\n \r\nAbout Plastics Color Corporation\n\r\nPlastics Color Corporation (PCC),  headquartered in Calumet City, Ill., is a global provider of colorants, compounds, additive masterbatches and custom polymer technologies for an extensive range of markets including pharmaceuticals, medical, consumer goods and others. PCC supports virtually every type of manufacturing process and material. We engage our customers from concept to commercialization and help them develop new cutting-edge products that lead the market. PCC has more than 40 years’ experience in the polymer industry and operates fully-equipped product development laboratories and manufacturing facilities in California, Illinois, North Carolina, and Nanjing, China. PCC’s Illinois and North Carolina labs are certified by the American Association for Laboratory Accreditation, A2LA. PCC also provides testing and product development services through our Solutions Center in Asheboro, N.C. For more information, call Timothy Workman at (440) 670-8802 or visit www.plasticscolor.com. \nAbout Raschig GmbH\n\r\nWith almost 90 years of experience with thermosetting materials, Raschig's Plastics Division has expanded its standard product range of free-flowing molding compounds over the past few years through intensive development work as well as specific acquisitions. Various products have been developed in close cooperation with our customers to solve specific problems e.g. in the automobile, electrical and electrical engineering industries. Raschig molding compounds fulfill the highest quality requirements and conform to all current regional directives. The Plastics Division has a well-equipped pilot plant in Ludwigshafen, possessing the same technologies as in the main production, where it is able to develop materials as well as carry out various application tests.\r\n\n"], "news_url": "http://plasticscolor.com/about/news/press-releases/114-plastics-color-corp-now-offering-thermoset-compounds.html", "title": ["\n\n\t\t\t\t\t\t\t\t\t\t\t\tPlastics Color Corp. Now Offering Thermoset Compounds\t\t\t\t\t\t\t\t\t\n"]}]